index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Magí Romanyà</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Magí Romanyà Serrasolsas" />
<link rel="stylesheet" href="https://cdn.simplecss.org/simple.min.css" />
</head>
<body>
<div id="content">
<h1 class="title">Magí Romanyà</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgb7b64ad">About me</a></li>
<li><a href="#org8ced9dc">Web posts</a></li>
<li><a href="#org9245b46">Past Projects</a></li>
<li><a href="#orgcae0247">Contact information</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgb7b64ad" class="outline-2">
<h2 id="orgb7b64ad">About me</h2>
<div class="outline-text-2" id="text-orgb7b64ad">
<p>
I am a computer graphics researcher pursuing my PhD under Dr. Miguel Ángel Otaduy, focusing in differentiable physics simulations.
With a background in physics from Universitat de Barcelona and a Master's in computer graphics from URJC, I'm passionate about recreating everyday physical phenomena within virtual enviroments.
</p>
</div>
</div>

<div id="outline-container-org8ced9dc" class="outline-2">
<h2 id="org8ced9dc">Web posts</h2>
<div class="outline-text-2" id="text-org8ced9dc">
<p>
Sometimes I take a little time to write small posts about things I have found interesting, not obvious, etc.
</p>
<ul class="org-ul">
<li><a href="continuous_adjoint_method.html">Continuous adjoint method</a></li>
<li><a href="visualization_of_gradient_fields.html">Visualization of gradient fields</a></li>
<li><a href="differential_simulation.html">Differentiable simulation</a></li>
</ul>
</div>
</div>

<div id="outline-container-org9245b46" class="outline-2">
<h2 id="org9245b46">Past Projects</h2>
<div class="outline-text-2" id="text-org9245b46">
<p>
Here list the internships or projects I've been involved during my career.
</p>
<ul class="org-ul">
<li><a href="mslab.html">Master's Thesis in MSLab</a>: Differentiable simulation of mass-spring simulations with contacts.</li>
<li><a href="tfg.html">Undergraduate Thesis Project</a>: Computing crustal deformation of the Iberian Peninsula.</li>
<li><a href="alba.html">ALBA Synchrotron</a>: Designing an electron beam simulation from a thermionic RF-gun.</li>
<li><a href="ubics.html">UBICS</a>: Working with large sets of bibliometric data using scopus and python.</li>
</ul>
</div>
</div>

<div id="outline-container-orgcae0247" class="outline-2">
<h2 id="orgcae0247">Contact information</h2>
<div class="outline-text-2" id="text-orgcae0247">
<ul class="org-ul">
<li><a href="mailto:magiromanya@gmail.com">Email: magiromanya@gmail.com</a></li>
<li><a href="https://github.com/MagiRomanya">GitHub: MagiRomanya</a></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Magí Romanyà Serrasolsas</p>
</div>
</body>
</html>
